{"pageProps":{"note_id":"book notes__the bhagvad gita__index","noteData":{"metadata":{"title":"The Bhagvad Gita","date":"2023-04-06"},"content":"<h2>The Text</h2>\n<p>(Translation and comments by <a href=\"https://en.wikipedia.org/wiki/Sarvepalli_Radhakrishnan\">S. Radhakrishnan</a>)</p>\n<ol>\n<li>\n<p><a href=\"/notes/book%20notes__the%20bhagvad%20gita__chapter_1\">The Distress of Arjuna</a></p>\n</li>\n<li>\n<p><a href=\"/notes/book%20notes__the%20bhagvad%20gita__chapter_2\">Samkhya Yoga</a></p>\n</li>\n</ol>\n<hr>\n<h2>Notes / Summary</h2>\n<h3>The Distress of Arjuna</h3>\n<ol>\n<li>\n<p><em>The world is a Dharmakshetra, the battleground for a moral struggle.</em> It is also said to be <em>Karmabhumi</em> where we work out our karma and fulfil the purpose of soul making.</p>\n</li>\n<li>\n<p><em>Dvija</em>: literally, <em>\"twice-born\"</em>. We are born into the world of nature; our second birth is into the world of spirit.</p>\n</li>\n<li>\n<p>Throughout Hindu and Buddhist literatures, the chariot stands for the psychophysical vehicle. The steeds are the senses, the reins their controls, but the charioteer, the guide is the spirit or real self, <em>Aatman</em>. Krishna, the charioteer, is the Spirit in us.</p>\n</li>\n<li>\n<p>\"They, that are desirous of victory, conquer not so much by might and prowess as by truth, compassion, piety and virtue. Victory is certain to be where Krishna is, Victory is one of his attributes, so also is humility.\"</p>\n</li>\n<li>\n<p>The establishment of the kingdom of God on earth is a cooperative enterprise between God and man. Man is a co-sharer in the work of creation.</p>\n</li>\n<li>\n<p>Arjuna's words [of distress] make us think of the loneliness of man oppressed by doubt, dread of waste and emptiness, from whose being the riches of heaven and earth and the comfort of human affection are slipping away. This intolerable sadness is generally the experience of all those who aspire for the vision of Reality.</p>\n</li>\n<li>\n<p>In moments of great sorrow we are tempted to adopt the method of renunciation.</p>\n</li>\n<li>\n<p>Arjuna is being guided by social conventions and customary morality and not by his individual perception of the truth. He has to slay the symbols of this external morality and develop inward strength. His former teachers who gave him guidance in life have to be slain before he can develop the wisdom of the soul.</p>\n</li>\n<li>\n<p>Arjuna's words are utterred in agony and love. On the very edge of the battle, Arjuna loses heart and <em>all worldly considerations persuade him to abstain from the battle</em>. He has yet to realize that wives and children, teachers and kinsmen, are dear not for their own sake, but for the sake of the Self.</p>\n</li>\n<li>\n<p>Arjuna has still to listen to the voice of the teacher who declares that he should lead a life in which his acts will not have their root in desire, that there is such a thing as <em>nishkama karma</em> - <em>desireless action</em>.</p>\n</li>\n<li>\n<p>The distress of Arjuna is a dramatization of a perpetually recurring predicament. Man, on the threshold of higher life, feels disappointed with the glamour of the world and yet illusions cling to him and he cherishes them. He has to fight the enemies of selfishness and stupidity, and overcome the dark ignorance of his self-centered ego. It is the evolution of the human soul that is portrayed here. The fight takes place every moment in the soul of man.</p>\n</li>\n<li>\n<p><em>Bhrahmavidyaa</em>: The science of the Absolute. To help us understand the nature of reality is the purpose of Brahmavidya.</p>\n</li>\n<li>\n<p><em>Yogashaastra</em>: The scripture of Yoga. There are many who regard philosophy as irrelevant to life. It is said that philosophy deals with the changeless universe of reality and life with the transitory world of process. This view recieved plausibility from the fact that, in the West, philosophic speculation originated in the city states of ancient Greece, where there were two classes of a wealthy and leisured aristocracy indulging in the luxury of philosophic speculation and a large slave population devoid of the pursuit of the fine and practical arts. Marx's criticism, that philosophers interpret the world while our task is to change it, does not apply to the author of the Gita, who gives us not only a philosophical inerpretation, <em>brahmavidyaa</em>, but also a practical programme, <em>yogashaastra</em>. Our world is not a spectacle to contemplate; it is a field of battle. Only for the Gita improvement in the individual nature is the way to social betterment.</p>\n</li>\n<li>\n<p><em>Krishnaarjunasamvade</em>: The dialogue between Krishna and Arjuna. The author of the Gita gives dramatic expression to the felt presence of God in man. The innermost core of his soul is also the divine center of the whole universe. Arjuna's deepest self is Krishna.</p>\n</li>\n<li>\n<p><em>Vishaada</em>: Depression. The Chapter ends in dejection and sorrow and this is also called <em>Yoga</em> as this darkness of the soul is an essential step in the progress to spiritual life. Most of us go through life without facing the ultimate questions. It is in rare crises, when our ambitions lie in ruins at our feet, when we realize in remorse and agony the sad mess we have made of our lives, when we cry out 'Why are we here?' 'What does all this mean and where do we go from here?' 'My God, My God, why hast thou forsaken me?'</p>\n</li>\n<li>\n<p>Arjuna passes through a great spiritual tension. When he detaches himself from his social obligations and asks why he should carry out the duty expected of him by society, he gets behind his socialized self and has full awareness of himself as an individual, alone and isolaed. He faces the world as a stranger thrown into a threatening chaos. The new freedom creates a deep feeling of anxiety, aloneness, doubt and insecurity. If he is to function successfully, these feelings must be overcome.</p>\n</li>\n</ol>\n<h3>Samkhya Yoga</h3>\n<ol>\n<li>\n<p><em>niscitam</em>: for certain; Arjuna is driven not only by despair, anxiety and doubt but also by an ardent wish for certainity.</p>\n</li>\n<li>\n<p>To realise one's unreason is to step towards one's development to reason. The consciousness of imperfection indicates that the soul is alive. So long as it is alive, it can improve even as a living body can heal, if it is hurt or cut to a point. The human being is led to a higher condition through a crisis of contrition.</p>\n</li>\n<li>\n<p>It is the general experience of seekers that they are assailed by doubts and difficulties, even when they are on the threshold of light. The light as it begins to shine in any soul provokes the darkness to resist it. Arjuna faces difficulties, outward and inward, such as the resistance of relations and friends, doubts and fears, passions and desires. They must all be laid on the altar and consumed in the fire of wisdom. The struggle with darkness will continue until the light fills one's whole being.</p>\n</li>\n<li>\n<p><em>na yotsya</em>: 'I will not fight.' Arjuna, without waiting for the advice of the teacher, seems to have made up his mind. While he asks the teacher to advise him, his mind is not open. The task of the teacher becomes more difficult.</p>\n</li>\n<li>\n<p><em>govinda</em>: The omniscience of the teacher is indicated by this word.</p>\n</li>\n<li>\n<p><em>tusnim babhuva</em>: became silent. The voice of truth can be heard only in silence.</p>\n</li>\n<li>\n<p>The smile indicates that [Krishna] saw throught Arjuna's attempt at rationalization or what is now known as wishful thinking. The attitude of the saviour God who knows all the sins and sorrows of suffering humanity is one of tender pity and wistful understanding.</p>\n</li>\n<li>\n<p>Wise men do not grieve for the dead or the living.</p>\n</li>\n<li></li>\n</ol>"},"allNotesIndex":{"base_name":"notes","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes","notes_data":[{"id":"quotes","metadata":{"title":"Quotes","date":"2023-03-21"}}],"directories":[{"base_name":"book notes","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/book notes","notes_data":[{"id":"dokkodo","metadata":{"title":"Dokkodo","date":"2023-03-23"}},{"id":"if","metadata":{"title":"\"If\"","date":"2023-03-27"}},{"id":"worry","metadata":{"title":"Worry","date":"2023-03-29"}}],"directories":[{"base_name":"the bhagvad gita","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/book notes/the bhagvad gita","notes_data":[{"id":"chapter_1","metadata":{"title":"Chapter 1","date":"2023-04-06"}},{"id":"chapter_2","metadata":{"title":"Chapter 2","date":"2023-04-08"}},{"id":"index","metadata":{"title":"The Bhagvad Gita","date":"2023-04-06"}}],"directories":[]}]},{"base_name":"economics","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/economics","notes_data":[],"directories":[{"base_name":"microeconomics","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/economics/microeconomics","notes_data":[{"id":"index","metadata":{"title":"Principles of Microeconomics","date":"2023-03-23"}},{"id":"lecture_1","metadata":{"title":"Lecture 1","date":"2023-03-23"}},{"id":"lecture_2","metadata":{"title":"Lecture 2","date":"2023-03-23"}},{"id":"lecture_3","metadata":{"title":"Lecture 3","date":"2023-03-23"}},{"id":"lecture_4","metadata":{"title":"Lecture 4","date":"2023-04-01"}},{"id":"lecture_5","metadata":{"title":"Lecture 5","date":"2023-04-01"}},{"id":"lecture_6","metadata":{"title":"Lecture 6","date":"2023-04-01"}}],"directories":[]}]},{"base_name":"machine learning","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/machine learning","notes_data":[{"id":"cpp-grad","metadata":{"title":"cpp-grad","date":"2023-04-17"}},{"id":"karpathy-lectures","metadata":{"title":"Andrey Karpathy's Lectures","date":"2023-05-14"}},{"id":"study-plan","metadata":{"title":"ML Study plan","date":"2024-01-14"}}],"directories":[{"base_name":"alpha zero","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/machine learning/alpha zero","notes_data":[{"id":"1-the-start","metadata":{"title":"1. The Start","date":"2024-01-14"}},{"id":"2-initial-plan","metadata":{"title":"2. Initial plan","date":"2024-01-14"}},{"id":"3-supervised-learning","metadata":{"title":"3. Supervised Learning","date":"2024-01-15"}},{"id":"4-experimentation","metadata":{"title":"4. Experimentation Framework","date":"2024-01-20"}},{"id":"5-visualization","metadata":{"title":"5. Visualization","date":"2024-01-21"}},{"id":"_notes","metadata":{"title":"_notes"}}],"directories":[]}]}]}},"__N_SSG":true}