{"pageProps":{"note_id":"book notes__the bhagvad gita__chapter_2","noteData":{"metadata":{"title":"Chapter 2","date":"2023-04-08"},"content":"<h2>Samkhya Yoga</h2>\n<h3>Krishna's Rebuke and Exhortation to be Brave</h3>\n<blockquote>\n<p>Sanjaya uvaca</p>\n</blockquote>\n<p>Sanjaya said:</p>\n<ol>\n<li>\n<blockquote>\n<p>Tam tatha krpayavishtam asrupurnaakulekshanam<br>\nVisidantamidam vakyam uvacha Madhusudana.</p>\n</blockquote>\n<blockquote>\n<p>To him who was thus overcome by pity, whose eyes were filled with tears and who was much depressed in mind, Madhusudana (Krishna) spoke these words.</p>\n</blockquote>\n</li>\n</ol>\n<p>The pity of Arjuna has nothing in common with Divine Compassion. It is a form of self-indulgance, a shrinking of the nerves from an act which requires him to hurt his own people. Arjuna recoils from his task in a mood of sentimental self-pity and his teacher rebukes him. That the Kauravas were his kinsmen he had known before.</p>\n<blockquote>\n<p>Sribhagvan uvaca</p>\n</blockquote>\n<p><em>The Lord</em> said:</p>\n<ol start=\"2\">\n<li>\n<blockquote>\n<p>Kutastvaa kashmalamidam vishame samupasthitam<br>\nAnaaryajushtamasvargyam akirtikaramarjuna</p>\n</blockquote>\n<blockquote>\n<p>Whence has come to thee this stain (this dejection) of spirit in this hour of crisis? It is unknown to men of noble mind (not cherished by the Aryans); it does not lead to heaven; (on earth) it causes disgrace, O Arjuna.</p>\n</blockquote>\n</li>\n</ol>\n<p><em>anaaryajustam</em>: un-Aryan. The Aryans, it is contented by some, are those who accept a particular type of inward culture and social practice, which insists on courage and courtesy, nobility and straight dealing.</p>\n<p>In his attempt to release Arjuna from his doubts, Krishna refers to the doctrine of the indestructibility of the self, appeals to his sense of honour and martial traditions, reveals to him God's purpose and points out how action is to be undertaken in the world.</p>\n<ol start=\"3\">\n<li>\n<blockquote>\n<p>Klaibyam maasma gamah paartha naitat tvayyupapadyate<br>\nKshudram hridayadaurbalyam tyaktvottishtha parantapa</p>\n</blockquote>\n<blockquote>\n<p>Yeild not to this unmanliness, O Paartha (Arjuna), for it does not become thee.\nCast off this petty faintheartedness and arise, O Oppressor of the foes (Arjuna).</p>\n</blockquote>\n</li>\n</ol>\n<h3>Arjuna's Doubts are Unresolved</h3>\n<blockquote>\n<p>Arjuna uvaca</p>\n</blockquote>\n<p>Arjuna said:</p>\n<ol start=\"4\">\n<li>\n<blockquote>\n<p>Katham bhismamaham samkkhye dronanca madhusudana<br>\nishubhih pratiyotsyaami pujaarhaavarisuudana?</p>\n</blockquote>\n<blockquote>\n<p>How shall I strike Bhisma and Drona who are worthy of worship, O Madhusudana (Krishna), with arrows in battle, O Slayer of foes (Krishna)?</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Gurunahatvaa hi mahaanubhaavaan<br>\nshreyo bhoktum bhaiksyamapihaloke<br>\nHatvaarthakaamaamstu gurunihaiva<br>\nbhunjiya bhogan rudhirapradighdaan.</p>\n</blockquote>\n<blockquote>\n<p>It is better to live in this world by begging than to slay these honoured teachers. Though they are mindful of their gains, they are my teachers and by slaying them, only, I would enjoy in this world delights which are smeared with blood.</p>\n</blockquote>\n</li>\n</ol>\n<p><em>rudhirapadigdhaan</em>: smeared with blood. If we make ourselves the victims of every bloodstained page of history, if we hear the woes of women, the cries of children, the tales of calamity, of oppression and injustice in its myriad forms, no one with any human feelings would delight in such bloodstained conquests.</p>\n<ol start=\"6\">\n<li>\n<blockquote>\n<p>Na caitad vidmah kataran no gariyo<br>\nYadvaa jayema Yadi vaa no jayeyuh<br>\nYaaneva hatevaa na jijivishaamas<br>\nte 'vasthitaah parmukhe dhaartarashtraah.</p>\n</blockquote>\n<blockquote>\n<p>Nor do we know which for us is better, whether we conquer them or they conquer us. The sons of Dhritarashtra, whom if we slew we should not care to live, are standing before us in battle array.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Kaarpanya dosopahata svabhaavah<br>\npricchaami tvaam dharmasammudhacetaah<br>\nYac chreyah syaan niscitam bruhi tamne<br>\nsisyaste 'ham saadhi maam tvam prapannam.</p>\n</blockquote>\n<blockquote>\n<p>My very being is stricken with the weakness of (sentimental) pity. With my mind bewildered about my duty, I ask Thee. Tell me, for certain, which is better, I am Thy pupil; teach me, who am seeking refuge in Thee.</p>\n</blockquote>\n</li>\n</ol>\n<p><em>niscitam</em>: for certain; Arjuna is driven not only by despair, anxiety and doubt but also by an ardent wish for certainity.</p>\n<p>To realise one's unreason is to step towards one's development to reason. The consciousness of imperfection indicates that the soul is alive. So long as it is alive, it can improve even as a living body can heal, if it is hurt or cut to a point. The human being is led to a higher condition through a crisis of contrition.</p>\n<p>It is the general experience of seekers that they are assailed by doubts and difficulties, even when they are on the threshold of light. The light as it begins to shine in any soul provokes the darkness to resist it. Arjuna faces difficulties, outward and inward, such as the resistance of relations and friends, doubts and fears, passions and desires. They must all be laid on the altar and consumed in the fire of wisdom. The struggle with darkness will continue until the light fills one's whole being.</p>\n<p>Weighed down by wretchedness, confused about what is right and wrong, Arjuna seeks light and guidance from his teacher, the Divine with him, within his self. Man cannot be left to his own devices. When one's world is in ruins, one can only turn within and seek illumination as the gift of God's infinite compassion.</p>\n<p>Arjuna does not ask for a metaphysic as he is not a seeker of knowledge; as a man of action he asks for the law of action, for his dharma, for what he has to do in this difficulty. 'Master, what wouldst thou have me to do?'</p>\n<p>Like Arjuna, the aspirant must realize his weakness and ignorance and yet be anxious to do God's will and discover what it is.</p>\n<ol start=\"8\">\n<li>\n<blockquote>\n<p>Na hi prapashyami mamaapanudyaad<br>\nyac chokam ucchosanam indriyaanaam<br>\nAvaapya bhuumaav asapatnam riddham<br>\nraajyam suraanaam api caadhipatyam.</p>\n</blockquote>\n<blockquote>\n<p>I do not see what will drive away this sorrow which dries up my senses even if I should attain rich and unrivalled kingdom on earth or even the sovereignty of the gods.</p>\n</blockquote>\n</li>\n</ol>\n<p>The conflict in Arjuna must be healed. He must attain new, integral, comprehensive consciousness.</p>\n<blockquote>\n<p>Sanjaya uvaca</p>\n</blockquote>\n<p>Sanjaya said:</p>\n<ol start=\"9\">\n<li>\n<blockquote>\n<p>Evamuktva Hrishikesham Gudakeshah Parantapah<br>\nNa Yotsya iti Govindam uktvaa tuusnim babhuuva ha.</p>\n</blockquote>\n<blockquote>\n<p>Having thus addressed Hrishikesha (Krishna), the mighty Gudakesha (Arjuna) said to Govinda (Krishna), 'I will not fight' and became silent.</p>\n</blockquote>\n</li>\n</ol>\n<p><em>na yotsya</em>: 'I will not fight.' Arjuna, without waiting for the advice of the teacher, seems to have made up his mind. While he asks the teacher to advise him, his mind is not open. The task of the teacher becomes more difficult.</p>\n<p><em>govinda</em>: The omniscience of the teacher is indicated by this word.</p>\n<p><em>tusnim babhuva</em>: became silent. The voice of truth can be heard only in silence.</p>\n<ol start=\"10\">\n<li>\n<blockquote>\n<p>Tamuvaaca hrishikesha prahasanniva bhaarata<br>\nSenayorubhayormadhye visidantamidam vacah.</p>\n</blockquote>\n<blockquote>\n<p>To him thus depressed in the midst of the two armies, O Bhaarata (Dhritarastra), Hrisikesha (Krishna) smiling as it were, spoke these words.</p>\n</blockquote>\n</li>\n</ol>\n<p>In that moment of depression, the sinking heart of Arjuna heard the Divine voice of Krishna. The smile indicates that he saw throught Arjuna's attempt at rationalization or what is now known as wishful thinking. The attitude of the saviour God who knows all the sins and sorrows of suffering humanity is one of tender pity and wistful understanding.</p>\n<h3>The Distinction between Self and Body</h3>\n<h4>We Should not Grieve for What is Imperishable</h4>\n<blockquote>\n<p>Sribhagvaan uvaca</p>\n</blockquote>\n<p><em>The Lord</em> said:</p>\n<ol start=\"11\">\n<li>\n<blockquote>\n<p>Asocyaan anvasocas tvam prajnaavadaams ca bhaasase<br>\nGataasuun agataasuums ca naa'nusocanti panditaah</p>\n</blockquote>\n<blockquote>\n<p>Thou grievest for those whom thou shouldst not grieve for, and yet thou speakest words about wisdom. Wise men do not grieve for the dead or the living.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Na tv evaaham jaatu naasam naa tvam neme janaadhipaah<br>\nNa caiva na bhavisyaamah sarve vayamatahparam</p>\n</blockquote>\n<blockquote>\n<p>Never was there a time when I was not, nor thou, nor these lords of men, nor will there ever be a time hereafter when we all shall cease to be.</p>\n</blockquote>\n</li>\n</ol>\n<p>The reference here is not to the eternity of the Absolute Spirit but to the pre-existence and post-existence of the empirical egos. The plurality of egos is a fact of the empirical universe.</p>\n<p>Each individual is an ascent from initial non-existence to full existence as a real, from asat to sat. While the Samkhya system postulates a plurality of souls, the Gita reconciles this with the unity, the one Ksetrajna in whom we live, move and have our being.</p>\n<p>Brahman is the basis of all things and is not itself a thing. Brahman does not exist in time but time it is. In this sense also, the egos have neither beginning nor end. Souls are like Brahman, for the cause and the effect are essentially one as the sayings, 'I am Brahman', 'That art Thou' indicate.</p>\n<p>Ignorance affects the individual spirit but not the Universal Spirit. Till the cosmic process ends, the multiplicity of indificuals with their distinctive qualitative contentes persists. The multiplicity is not sperable from the cosmos.</p>\n<p>While the liberated souls know the truth and live in it, the unliberated ones pass from birth to birth, tied by the bondage of workds.</p>\n<ol start=\"13\">\n<li>\n<blockquote>\n<p>Dehino'smin yathaa dehe kaumaaram yauvanam jaraa<br>\nTathaa dehaantarapraaptir dhirastatra na muhyati.</p>\n</blockquote>\n<blockquote>\n<p>As the soul passes in this body through childhod, youth and age, even so is its taking on of another body. The sage is not perplexed by this.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Maatraa-sparsaas tu kaunteya sitosnasukhaduhkhadaah<br>\nAagamaapaayino 'nityas taams titiksasva bhaarata</p>\n</blockquote>\n<blockquote>\n<p>Contacts (of senses) with their objects, O Son of Kunti (Arjuna), give rise to cold and heat, pleasure and pain. They come and go and do not last for ever, these learn to endure, O Bhaarata (Arjuna).</p>\n</blockquote>\n</li>\n</ol>\n<p>These opposites depend on limited and occasional causes wheras the joy of Brahman is universal, self-existent and independent of particular causes and objects. The indivisible being supports the variations of pleasure and pain of the egoistic existence which gets into contact with the multiple universe. These attitudes of pleasure and pain are deteremined by the force of habit. There is no obligation to be pleased with success and pained with failure. We can meet them with a perfect equanimity. It is the ego-consciousness which enjoys and suffers and it will continue to do so, so long as it is bound up with the use of life and body and is dependent on them for its knowledge and action. But when the mind becomes free and disinterested and sinks into that secret serenity, when its consciousness becomes illumined, it gladly accepts whatever happens, knowing full well that these contacts come and go and are not itself, though they happen to it.</p>\n<ol start=\"15\">\n<li>\n<blockquote>\n<p>Yam hi na vyathayayanty ete purusam purusarsabha<br>\nSamadukjsukham dhiram so 'mrtatvaaya kalpale.</p>\n</blockquote>\n<blockquote>\n<p>The man who is not troubled by these, O Chief of men (Arjuna), who remains the same in pain and pleasure, who is wise makes himself fit for eternal life.</p>\n</blockquote>\n</li>\n</ol>\n<p>Eternal life is different from surival of death which is given to every embodied being. It is the transcendence of life and death. To be subject to grief and sorrow, to be disturbed by the material happenings, to be deflected by them from the path of duty that has to be traversed, <em>niyatam karma</em>, shows that we are still victims of <em>avidya</em> or ignorance.</p>\n<ol start=\"16\">\n<li>\n<blockquote>\n<p>Naasato vidyate bhaavo nabhaavo vidyate satah<br>\nubhayorapi dristo 'ntastv anayos tattva-darshibhih</p>\n</blockquote>\n<blockquote>\n<p>Of the non-existent there is no coming to be; of the existent there is no ceasing to be. The conclusion about these two has been percieved by the seers of truth.</p>\n</blockquote>\n</li>\n</ol>\n<p>Shankara defines: Real (sat) is that in regard to which our consciousness never fails and unreal (asat) is that in regard to which our consciousness fails. Our consciousness of objects varies but not that of existence. The unreal which is the passing show of the world veils the unchanging reality which is forever manifest.</p>\n<p>According to Ramanuja: the unreal is the body and the real is the soul.</p>"},"allNotesIndex":{"base_name":"notes","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes","notes_data":[{"id":"quotes","metadata":{"title":"Quotes","date":"2023-03-21"}}],"directories":[{"base_name":"book notes","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/book notes","notes_data":[{"id":"dokkodo","metadata":{"title":"Dokkodo","date":"2023-03-23"}},{"id":"if","metadata":{"title":"\"If\"","date":"2023-03-27"}},{"id":"worry","metadata":{"title":"Worry","date":"2023-03-29"}}],"directories":[{"base_name":"the bhagvad gita","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/book notes/the bhagvad gita","notes_data":[{"id":"chapter_1","metadata":{"title":"Chapter 1","date":"2023-04-06"}},{"id":"chapter_2","metadata":{"title":"Chapter 2","date":"2023-04-08"}},{"id":"index","metadata":{"title":"The Bhagvad Gita","date":"2023-04-06"}}],"directories":[]}]},{"base_name":"economics","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/economics","notes_data":[],"directories":[{"base_name":"microeconomics","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/economics/microeconomics","notes_data":[{"id":"index","metadata":{"title":"Principles of Microeconomics","date":"2023-03-23"}},{"id":"lecture_1","metadata":{"title":"Lecture 1","date":"2023-03-23"}},{"id":"lecture_2","metadata":{"title":"Lecture 2","date":"2023-03-23"}},{"id":"lecture_3","metadata":{"title":"Lecture 3","date":"2023-03-23"}},{"id":"lecture_4","metadata":{"title":"Lecture 4","date":"2023-04-01"}},{"id":"lecture_5","metadata":{"title":"Lecture 5","date":"2023-04-01"}},{"id":"lecture_6","metadata":{"title":"Lecture 6","date":"2023-04-01"}}],"directories":[]}]},{"base_name":"machine learning","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/machine learning","notes_data":[{"id":"cpp-grad","metadata":{"title":"cpp-grad","date":"2023-04-17"}},{"id":"karpathy-lectures","metadata":{"title":"Andrey Karpathy's Lectures","date":"2023-05-14"}},{"id":"study-plan","metadata":{"title":"ML Study plan","date":"2024-01-14"}}],"directories":[{"base_name":"alpha zero","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/machine learning/alpha zero","notes_data":[{"id":"1-the-start","metadata":{"title":"1. The Start","date":"2024-01-14"}},{"id":"2-initial-plan","metadata":{"title":"2. Initial plan","date":"2024-01-14"}},{"id":"3-supervised-learning","metadata":{"title":"3. Supervised Learning","date":"2024-01-15"}},{"id":"4-experimentation","metadata":{"title":"4. Experimentation Framework","date":"2024-01-20"}},{"id":"5-visualization","metadata":{"title":"5. Visualization","date":"2024-01-21"}},{"id":"_notes","metadata":{"title":"_notes"}}],"directories":[]}]}]}},"__N_SSG":true}