{"pageProps":{"note_id":"book notes__the bhagvad gita__chapter_1","noteData":{"metadata":{"title":"Chapter 1","date":"2023-04-06"},"content":"<h2>The Distress of Arjuna</h2>\n<h3>The Question</h3>\n<p>Dhritarashtra said:</p>\n<ol>\n<li>\n<blockquote>\n<p>Dharmakshetre Kurukshetre Samveta Yuyutsavah<br>\nMamakah Pandavas cai va kim kuruvata Sanjayah?</p>\n</blockquote>\n<blockquote>\n<p>In the field of righteousness, the field of the Kurus, when my people and the sons of Pandu had gathered together, eager for battle, what did they do, O Sanjaya?</p>\n</blockquote>\n</li>\n</ol>\n<p><em>Dharmakshetre</em>: The field of righteousness.\nThe quality of deciding what is right or dharma is special to man. Hunger, sleep, fear and sex are common to men and animals. What distinguishes men from animals is the knowledge of right and wrong.</p>\n<p><em>The world is a Dharmakshetra, the battleground for a moral struggle.</em> The decisive issue lies in the hearts of men where the battles are fought daily and hourly. The ascent from earth to heaven, from suffering to spirit, is through the path of dharma.</p>\n<p>This world is a dharmakshetra, where the sacred flame of sprit is never said to go out. It is also said to be <em>Karmabhumi</em> where we work out our karma and fulfil the purpose of soul making.</p>\n<p>The aim of the Gita is not so much to teach a theory as to enforce practice, dharma.</p>\n<p>Life is a battle, a warfare against the spirit of evil. Creative process is one of perpetual tension between two incompatibilities, each standing against the other. By their mutual conflict, development is advanced and cosmic purpose furthered.</p>\n<p>The words 'Dharmakshetre Kurukshetre' suggest the law of Life by Death. War is at once punishment and cleansing for mankind. God is judge as well as redeemer. He destroys and creates. He is Shiva and Vishnu.</p>\n<p><em>Mamakah</em>: \"My people\". This sense of mineness is result of <em>ahamkara</em> which is the source of evil. <em>Mamakara</em> or Selfishness on the part of Kauravas which leads to the love of power and domination is brought out.</p>\n<h3>The Two Armies</h3>\n<p>Sanjaya said:</p>\n<ol start=\"2\">\n<li>\n<blockquote>\n<p>Drishtva tu pandavanikam vyudham duryodhanas tada<br>\nAcharyam upsangamya raja vachanam abravit.</p>\n</blockquote>\n<blockquote>\n<p>Then, Duryodhana the prince, having seen the army of the Pandavas drawn up in battle order, approached his teacher and spoke these words.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Pashyai tam panduputranam acharya mahtim chamum<br>\nVyudham drupadaputrena tava shishyena dhimata.</p>\n</blockquote>\n<blockquote>\n<p>Behold, O Teacher, this mighty army of the sons of Pandu organised by thy wise pupil, the son of Drupada.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Atra shura maheshavasa bimararjunasama yudhi<br>\nYuyudhano viratas cha drupadashcha maharatha.</p>\n</blockquote>\n<blockquote>\n<p>Here are heroes, great bowmen equal in battle to Bhima and Arjuna - Yuyudhana, Virata and Drupada, a mighty warrior.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Drishtaketus chekitanah kashirajas cha viryavan<br>\nPurujit Kuntibhojascha saibyas cha narapungavah.</p>\n</blockquote>\n<blockquote>\n<p>Drishtaketuh, Chekitana, and the valiant King of Kashi, also Purujit, Kuntibhoja, and Saibhya the foremost of men.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Yudhamanyus cha vikrantah Uttamaujas cha viryavan<br>\nSaubhadro Draupadeyas cha sarva eva maharatha.</p>\n</blockquote>\n<blockquote>\n<p>Yudhamanya, the strong and Uttamauja the brave; also the son of Subhadra and sons of Draupadi, all of them great warriors.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Askmakam tu Vishistha ye tan nibodha dvijottamah<br>\nNayaka mama sainyasa samjnartham tan bravimi te.</p>\n</blockquote>\n<blockquote>\n<p>Know also, O Best of the twice-born, the leaders of my army, those who are most distinguished among us. I will name them now for thy information.</p>\n</blockquote>\n</li>\n</ol>\n<p><em>Dvijotamma</em>: O Best of the twice-born. A <em>dvija</em> is one who is invested with the sacred thread, literally, one who is twice-born.</p>\n<p>Initiation into the life of sprit is the aim of education. We are born into the world of nature; our second birth is into the world of spirit. The individual born a child of nature grows up into his spiritual manhood and becomes a child of light.</p>\n<ol start=\"8\">\n<li>\n<blockquote>\n<p>Bhavan Bhishmas cha Karnas cha Kripyas cha Samitinjayah<br>\nAshvatthama Vikaranas cha Saumadattis tathaiva cha.</p>\n</blockquote>\n<blockquote>\n<p>Thyself and Bhishma and Karna and Kripa, ever victorious in battle; Ashvatthaman, Vikarna, and also the son of Somadatta.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Anye cha bhavah shura madarthe tyaktajivitah<br>\nNanasatrapraharnah sarve yuddhavisharadah.</p>\n</blockquote>\n<blockquote>\n<p>And many other heroes who have risked their lives for my sake. They are armed with many kinds of weapons and are all well skilled in war.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Aparyaptam tad asmakam balam bhismabhirakshitam<br>\nParyaptam tv idam etesham balam bhimabhirakshitam.</p>\n</blockquote>\n<blockquote>\n<p>Unlimited is this army of ours which is guarded by Bhishma, while that army of theirs which is guarded by Bhima is limited.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Anyeshu cha sarveshu yathabhagam avasthitah<br>\nBhishmam evabhirakshantu bhavantah sarva eva hi.</p>\n</blockquote>\n<blockquote>\n<p>Therefore do ye all support Bhishma, standing firm in all the fronts, in your respective ranks.</p>\n</blockquote>\n</li>\n</ol>\n<h3>The Sounding of the Conchshells</h3>\n<ol start=\"12\">\n<li>\n<blockquote>\n<p>Tasya samjanyam harsham kuruvriddhah pitamahah<br>\nSimhanadam vinadyoccaih sankham dadhmau pratapvan.</p>\n</blockquote>\n<blockquote>\n<p>In order to cheer him up, the aged kuru, his valiant grandsire, roared aloud like a lion and blew his conch.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Tatah sankhas cha bheryas cha panavanakagomukhah<br>\nSahasaivabhyahanyanta sa sabdas tumulo 'bhavat.</p>\n</blockquote>\n<blockquote>\n<p>Then conches and kettledrums, tabors and drums and horns suddenly were struck and the noise was tumultuous.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Tatah svetair hayair yukte mahati syandane shitatau<br>\nMadhavah Pandavas chaiva divyau sankhau pradhadhmatuh.</p>\n</blockquote>\n<blockquote>\n<p>When stationed in their great chariot, yoked to white horses, Krishna and Arjuna blew their celestial conches.</p>\n</blockquote>\n</li>\n</ol>\n<p>Throughout Hindu and Buddhist literatures, the chariot stands for the psychophysical vehicle. The steeds are the senses, the reins their controls, but the charioteer, the guide is the spirit or real self, <strong>Aatman</strong>. Krishna, the charioteer, is the Spirit in us.</p>\n<ol start=\"15\">\n<li>\n<blockquote>\n<p>Panchajanyam Hrishikesho Devadattam Dhananjayah<br>\nPaundram dhadhmau mahashankham Bhimakarma vrikodharah.</p>\n</blockquote>\n<blockquote>\n<p>Krishna blew his Panchajanya and Arjuna his Devadatta, and Bhima of terrific deeds blew his mighty conch, Paundra.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Antantavijayam raja kuntiputro Yudhishthirah<br>\nNakula Sahadevas cha Sughoshamanipushpakau,</p>\n</blockquote>\n<blockquote>\n<p>Prince Yudhishthira, the son of Kunti, blew his Anantavijaya and Nakula and Sahadeva blew their Sughosha and Manipushpaka.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Kashyas cha parameshvasah Sikhandi cha maharathah<br>\nDhristadyumno viratas cha Satyakis chaparajitah.</p>\n</blockquote>\n<blockquote>\n<p>And the king of Kashi, the Chief of Archers, Shikhandin, the great warrior, Dhristadyumna, and Virata and the invincible Satyaki.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Drupado draupadeyas cha sarvasah prithivipate<br>\nSaubhadras cha mahabahuh sankhan dadhmuh prithak prithak.</p>\n</blockquote>\n<blockquote>\n<p>Drupada and the sons of Draupadi, O Lord of the Earth, and the strong-armed son of Subhadra, on all sides blew their respective conches.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Sa ghosho dhartarashtranam hridayani vyadarayat.<br>\nNabhas cha prithvinchaiva tumulo vyanunadyan.</p>\n</blockquote>\n<blockquote>\n<p>The tumultous uproar resounding through earth and sky rent the hearts of Dhritarashtra's sons.</p>\n</blockquote>\n</li>\n</ol>\n<h3>Arjuna Surveys the Two Armies</h3>\n<ol start=\"20\">\n<li>\n<blockquote>\n<p>Atha vyavasthitan drishtva dhartarashtran Kapidhvajah<br>\nPravritte Shastrasampate dhanur udyamamya Pandavah.</p>\n</blockquote>\n<blockquote>\n<p>Then Arjuna, whose banner bore the crest of Hamunan, looked at the sons of Dhritarashtra drawn up to battle order; and as the flight of missiles (almost) started, he took up his bow.</p>\n</blockquote>\n</li>\n</ol>\n<p><em>Pravritte Shastrasampate</em>: as the flight of the missiles started. The crisis throws Arjuna into great anguish. The thrill of anticipated battle is on them all, when, suddenly, in a moment of self-analysis, Arjuna realises that the struggle means the whole scheme of life, the great ideals of race and family, of law and order, of patriotism and reverence for the teacher, which he had loyally carried out till then, will have to be abandoned.</p>\n<ol start=\"21\">\n<li>\n<blockquote>\n<p>Hrishikesham tada vakyam idam aha mahipate<br>\nSenayorubhayormadhye ratham sthapaya me'cyuta.</p>\n</blockquote>\n<blockquote>\n<p>And, O Lord of the Earth, he spoke these words to Hrishikesha (Krishna): Draw up my chariot, O Achyuta (Krishna), between the two armies.</p>\n</blockquote>\n</li>\n</ol>\n<p>Achyuta: Immovable. Another name for Krishna.</p>\n<ol start=\"22\">\n<li>\n<blockquote>\n<p>Yavad etan nirikshe'ham yoddhukamanavasthitan<br>\nKairmayaa saha yoddhavyam asmin ranasamudyame.</p>\n</blockquote>\n<blockquote>\n<p>So that I may observe these men standing, eager for battle, with whom I have to contend in this strife of war.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Yotsyamanan avekshe'ham ya ete 'tra samagatah<br>\nDhartarastrasya durbuddher yuddhe priyachikirshavah.</p>\n</blockquote>\n<blockquote>\n<p>I wish to look at those who are assembled here, ready to fight and eager to achieve in battle what is dear to the evil-minded son of Dhartarastra.</p>\n</blockquote>\n</li>\n</ol>\n<p>[That very morning, Arjuna was certain of victory as Narayana himself was on his side.</p>\n<p>\"They, that are desirous of victory, conquer not so much by might and prowess as by truth, compassion, piety and virtue. Victory is certain to be where Krishna is, Victory is one of his attributes, so also is humility.\"</p>\n<p>And yet, as a man of action, Arjuna did not think out the implications of his enterprise. The presence of his teacher, the consciousness of the Divine, helps him to realize that the enemies he has to fight are dear and sacred to him. He has to cut social ties for the protection of justice and the suppression of lawless violence.]</p>\n<p>The establishment of the kingdom of God on earth is a cooperative enterprise between God and man. Man is a co-sharer in the work of creation.</p>\n<ol start=\"24\">\n<li>\n<blockquote>\n<p>Evam ukto Hrisikesho Gudakeshena Bharata<br>\nSenayorubhayormadhye sthapayitva rathottamam.</p>\n</blockquote>\n<blockquote>\n<p>Thus addressed by Gudakesha (Arjuna), Hrishikesha (Krishna) drew up that best of chariots, O Bharata (Dhritarashtra), between the two armies.</p>\n</blockquote>\n</li>\n</ol>\n<p>(* Hrishikesha = The lord of the senses.  Gudakesha = Conqueror of sleep = conqueror of ignorance.)</p>\n<ol start=\"25\">\n<li>\n<blockquote>\n<p>Bhishmadronapramukhatah sarvesham cha mahikshitam<br>\nUvacha Partha pashyaitan samavetan kuruniti.</p>\n</blockquote>\n<blockquote>\n<p>In front of Bhishma, Drona, and all the chiefs he said: 'Behold, O Partha (Arjuna), these Kurus assembled (here).'</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Tatraapashyat sthitan Parthah pitrinataha pitamahan<br>\nAcharyan matulan bhratrin putran pautran sakhimstatha.</p>\n</blockquote>\n<blockquote>\n<p>There saw Arjuna standing fathers and grandfathers, teachers, uncles, brothers, sons and grandsons as also companions.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Shvasuran suhridas chaiva senayorubhayor api<br>\nTan smikshya sa kaunteyah sarvan bandhun avasthitan,</p>\n</blockquote>\n<blockquote>\n<p>And also fathers-in-law and friends in both the armies. When the son of Kunti (Arjuna) saw all these kinsmen thus standing arrayed,</p>\n</blockquote>\n</li>\n</ol>\n<h3>The Distress of Arjuna</h3>\n<ol start=\"28\">\n<li>\n<blockquote>\n<p>Kripaya parayavisto visidannidam abravit.<br>\nDrishtvemam Svajanam Krishna yuyutsum samupasthitam</p>\n</blockquote>\n<blockquote>\n<p>He was overcome with great compassion and uttered this in sadness;\nWhen I see my own people arrayed and eager for fight, O Krishna;</p>\n</blockquote>\n</li>\n</ol>\n<p><em>Svajanam</em>: His own people, kinsmen. It is not so much slaughter but slaughter of one's own people that causes distress and anxiety to Arjuna. We are gennerally inclined to take a mechanical view of wars and get lost in statistics. But, with a little imagination, we can realise how our enemeies are human beings, 'fathers and grandfathers' with their own individual llives, with their longings and aspirations. Later on, Arjuna asks whether victory is worth much after we make the place a desert waste.</p>\n<ol start=\"29\">\n<li>\n<blockquote>\n<p>Sidanti mama gaatraani mukhancha parishusyati.<br>\nVeputhescha sharire me romaharshascha jaayate</p>\n</blockquote>\n<blockquote>\n<p>My limbs quail, my mouth goes dry, my body shakes, and my hair stands on end.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Gaandivam sramsate hastat tvak caiva paridahyate.<br>\nNa cha shanknomyavasthatum bramativa cha me manah;</p>\n</blockquote>\n<blockquote>\n<p>(The bow) Gaandiva slips from my hand and my skin too is burning all over. I am not able to stand steady. My mind is reeling.</p>\n</blockquote>\n</li>\n</ol>\n<p>Arjuna's words make us think of the loneliness of man oppressed by doubt, dread of waste and emptiness, from whose being the riches of heaven and earth and the comfort of human affection are slipping away. This intolerable sadness is generally the experience of all those who aspire for the vision of Reality.</p>\n<ol start=\"31\">\n<li>\n<blockquote>\n<p>Nimittani cha pashyami vipritani Keshava;<br>\nNa cha shryeo'nupashyaami hatva svajanamahave;</p>\n</blockquote>\n<blockquote>\n<p>And I see evil omens, O Keshava (Krishna), Nor do I foresee any good by slaying my own people in the fight.</p>\n</blockquote>\n</li>\n</ol>\n<p>Arjuna's attention to omens indicates his mental weakness and instability.</p>\n<ol start=\"32\">\n<li>\n<blockquote>\n<p>Na kankshe vijayam Krishna na cha rajyam shukhani cha.<br>\nKim no rajyena Govinda kim bhogair jivitven va?</p>\n</blockquote>\n<blockquote>\n<p>I do not long for victory, O Krishna, nor kingdom nor pleasures. Of what use is kingdom to us, O Krishna, or enjoyment or even life?</p>\n</blockquote>\n</li>\n</ol>\n<p>In moments of great sorrow we are tempted to adopt the method of renunciation.</p>\n<ol start=\"33\">\n<li>\n<blockquote>\n<p>Yesham arthe kankshitam no rajyam bhogah sukhani cha,<br>\nTa ime 'vasthita yuddhe praanaamstyaktvaa dhanani cha.</p>\n</blockquote>\n<blockquote>\n<p>Those for whose sake we desire kingdom, enjoyments and pleasures, they stand here in battle, renouncing their lives and riches.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Aacharyaah pitarah putras tathaiva ca pitaamahaah,<br>\nMaatulah shvashurah pautraah shyaalaah sambandhinastathaa;</p>\n</blockquote>\n<blockquote>\n<p>Teachers, fathers, sons and also grandfathers; uncles and fathers-in-law, grandsons and brothers-in-law and (other) kinsmen;</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Etan na hantum icchaami ghanto 'pi Madhusudana<br>\nApi trailokyaraajyasa hetoh kim nu mahikrite.</p>\n</blockquote>\n<blockquote>\n<p>These I would not consent to kill, though they kill me, O Madhusudana (Krishna), even for the kingdom of the three worlds; how much less for the sake of the earth?</p>\n</blockquote>\n</li>\n</ol>\n<p>The three worlds refer to the Vedic idea of earth, heaven and atmosphere (antariksha).</p>\n<ol start=\"36\">\n<li>\n<blockquote>\n<p>Nihatya dhaartaraastran nah ka pritih syajjanaardana<br>\nPaapamevaasrayedasmaan hatvaitaanaatataayinah.</p>\n</blockquote>\n<blockquote>\n<p>What pleasure can be ours, O Krishna, after we have slain the sons of Dhritarashtra? Only sin will accrue to us if we kill these malignants.</p>\n</blockquote>\n</li>\n</ol>\n<p>How shall we benefit by this bloody sacrifics? What is the goal we expect to reach over the dead bodies of all that we hold dear?</p>\n<p>Arjuna is being guided by social conventions and customary morality and not by his individual perception of the truth. He has to slay the symbols of this external morality and develop inward strength. His former teachers who gave him guidance in life have to be slain before he can develop the wisdom of the soul. Arjuna is still talking in terms of enlightened selfishness.</p>\n<p>Even though the enemies are the aggressors, we should not kill them. Do not commit a sin in retaliation for another sin.</p>\n<ol start=\"37\">\n<li>\n<blockquote>\n<p>Tasmaannarhaa vayam hantum dhaartarasahtraan svabaandavaan<br>\nsvajanam hi katham hatva sukhinah syaama maadhava?</p>\n</blockquote>\n<blockquote>\n<p>So it is not right that we slay our kinsmen, the sons of Dhritarashtra. Indeed, how can we be happy, O Maadhava (Krishna), if we kill our own people?</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Yadyapyete na pashyanti lobhopahatachetasah<br>\nKulakshayakritam dosham mitradrohe ca paatakam;</p>\n</blockquote>\n<blockquote>\n<p>Even if these whose minds are overpowered by greed, see no wrong in the destruction of the family and no crime in treachery to friends;</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Katham na jneyamasmaabhih paapaadasmaanivartitum<br>\nKulakshayakritam dosham prapasyadbhir Janardana?</p>\n</blockquote>\n<blockquote>\n<p>Why should we not have the wisdom to turn away from this sin, O Janardana (Krishna), we who see the wrong in the destruction of the family?</p>\n</blockquote>\n</li>\n</ol>\n<p>They are stricken blind by greed and have no understanding, but we are able to see the wrong. Even if we assume that they are guilty of a selfish passion and greed, it is wrong to slay them and it is a greater wrong because they who are blinded by passion are unconscious of the guilt they are committing, but our eyes are open and we see that it is a sin to slay.</p>\n<ol start=\"40\">\n<li>\n<blockquote>\n<p>Kulakshaye pranasyanti kuladharmaah sanaatanaah<br>\nDharme nashte kulam kritsnam adharmo 'bhibhavatyuta.</p>\n</blockquote>\n<blockquote>\n<p>In the ruin of a family, its ancient laws are destroyed: and when the laws perish, the whole family yeilds to lawlessness.</p>\n</blockquote>\n</li>\n</ol>\n<p>Wars tend to tear us away from our natural home surroundings and uproot us from social traditions which are the distillation of the mature will and experience of the people.</p>\n<ol start=\"41\">\n<li>\n<blockquote>\n<p>Adharmaabhibhavaat krishna pradyusyanti kulastriyah<br>\nStrisu dustaasu vaarsneya jaayate varnasankarah.</p>\n</blockquote>\n<blockquote>\n<p>And when lawlessness prevails, O Vaarsaneya (Krishna), the women of the family become corrupted and when the women of the family are corrupted, confusion of castes arise.</p>\n</blockquote>\n</li>\n</ol>\n<p><em>Varna</em> is usually translated as caste, though the (present) system of caste in no way corresponds to the Gita ideal.</p>\n<ol start=\"42\">\n<li>\n<blockquote>\n<p>Sankaro narakaayaiva kulaghnaanaam kulasya ca<br>\nPatanti pitaro hyesaam luptapindodakakriyaah.</p>\n</blockquote>\n<blockquote>\n<p>And to hell does this confusion bring the family itself as well as those who have destroyed it. For the spirits of their ancestors fall, deprived of their offerings of rice and water.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Dosairetaih kulaghnanaam varanasankarakaarakaih<br>\nUtsaadyante jaatidharamah kuladharmaasca saasvatah.</p>\n</blockquote>\n<blockquote>\n<p>By the misdeeds of those who destroy a family and create confusion of varnas, the immemorial laws of the caste and the family are destroyed.</p>\n</blockquote>\n</li>\n</ol>\n<p>When we shatter the ideals enshrined in immemorials traditions, when we disturn the social equilibrium, we only bring chaos into the world.</p>\n<ol start=\"44\">\n<li>\n<blockquote>\n<p>Utsannakuladharmaanaam manusyaanaaam janaardana<br>\nNarake niyatam vaaso bhavatityanususruma.</p>\n</blockquote>\n<blockquote>\n<p>And we have heard it said, O Janaardana (Krishna), that the men of the families whose laws are destroyed needs must live in hell.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Aho bata mahat paapam kartum vyavasitaa vayam<br>\nYad rajyasukhalobhena hantum svajanamudyataah.</p>\n</blockquote>\n<blockquote>\n<p>Alas, what a great sin have we resolved to commit in striving to slay our own people through our greed for the pleasures of the kingdom!</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Yadi maamapratikaaram asastram sastra paanayah<br>\nDhaartaraastraa rane hanyus taanme kshmatram bhavet.</p>\n</blockquote>\n<blockquote>\n<p>Far better would it be for me if the sons of Dhritarastra, with weapons in hand, should slay me in the battle, while I remain unresisting and unarmed.</p>\n</blockquote>\n</li>\n</ol>\n<p>Arjuna's words are utterred in agony and love. He has his mind on the frontiers of two worlds. He is struggling to get something done as man has struggled from the beginning, and yet he is incapable of decision because of inability to understand either himslef or his fellows or the real nature of the universe in which he is placed. He is stressing the physical pain and the material discomfort which warfare involves. <em>The main end of life is not the pursuit of material happiness</em>. We are bound to miss it as we approach the end of life, with its incidents of old age, infirmity, death. For the sake of an ideal, for justice and love, we must stand up to tyranny and face pain and death. On the very edge of the battle, Arjuna loses heart and <em>all worldly considerations persuade him to abstain from the battle</em>. He has yet to realize that wives and children, teachers and kinsmen, are dear not for their own sake, but for the sake of the Self. Arjuna has still to listen to the voice of the teacher who declares that he should lead a life in which his acts will not have their root in desire, that there is such a thing as <em>nishkama karma</em> - <strong>desireless action</strong>.</p>\n<ol start=\"47\">\n<li>\n<blockquote>\n<p>Evamuktvaarjunah sankhye rathopastha upaavisat<br>\nVisrijya sasaram caapam shokasamvignamanasah.</p>\n</blockquote>\n<blockquote>\n<p>Having spoken thus on the (field of) battle, Arjuna sank down on the seat of his chariot, casting away his bow and arrow, his spirit overwhelmed with sorrow.</p>\n</blockquote>\n</li>\n</ol>\n<p>The distress of Arjuna is a dramatization of a perpetually recurring predicament. Man, on the threshold of higher life, feels disappointed with the glamour of the world and yet illusions cling to him and he cherishes them. He forgets his divine ancestry and becomes attached to his personality and is agitated by the conflicting forces of the world. Before he wakes up to the world of spirit and accepts the obligations imposed by it, he has to fight the enemies of selfishness and stupidity, and overcome the dark ignorance of his self-centered ego. Man cut off from spiritual nature has to be restored to it. It is the evolution of the human soul that is portrayed here. There are no limits of time and space to it. The fight takes place every moment in the soul of man.</p>\n<blockquote>\n<p>Iti Srimad Bhagvadgitasu Upanishatsu Brahmavidyaayaam Yogashaastre Srikrishnaarjunasamvaade Arjunavishaadayogo naama Prathamo'dhyayah |</p>\n</blockquote>\n<blockquote>\n<p>In the Upanishad of the Bhagvadgita, the science of the Absolute, the scripture of Yoga and the dialogue between Sri Krishna and Arjuna, this is the first chapter entitiled the Depression of Arjuna.</p>\n</blockquote>\n<p><em>Bhrahmavidyaa</em>: The science of the Absolute. To help us understand the nature of reality is the purpose of Brahmavidya. Logical investigation is an aid to the attainment of spiritual wisdom. Sankara, in his Aparoksaanubhuti, observes that without inquiry, wisdom cannot be attained by any other means, even sa things of the world cannot be seen without light.</p>\n<p><em>Yogashaastra</em>: The scripture of Yoga. There are many who regard philosophy as irrelevant to life. It is said that philosophy deals with the changeless universe of reality and life with the transitory world of process. This view recieved plausibility from the fact that, in the West, philosophic speculation originated in the city states of ancient Greece, where there were two classes of a wealthy and leisured aristocracy indulging in the luxury of philosophic speculation and a large slave population devoid of the pursuit of the fine and practical arts. Marx's criticism, that philosophers interpret the world while our task is to change it, does not apply to the author of the Gita, who gives us not only a philosophical inerpretation, <em>brahmavidyaa</em>, but also a practical programme, <em>yogashaastra</em>. Our world is not a spectacle to contemplate; it is a field of battle. Only for the Gita improvement in the individual nature is the way to social betterment.</p>\n<p><em>Krishnaarjunasamvade</em>: The dialogue between Krishna and Arjuna. The author of the Gita gives dramatic expression to the felt presence of God in man. The innermost core of his soul is also the divine center of the whole universe. Arjuna's deepest self is Krishna. Man and God need a third party as intermediary no more than do two lovers. No one is close to God as oneself and to get him we require only an ardent heart, a pure intention.</p>\n<p><em>Vishaada</em>: Depression. The Chapter ends in dejection and sorrow and this is also called <em>Yoga</em> as this darkness of the soul is an essential step in the progress to spiritual life. Most of us go through life without facing the ultimate questions. It is in rare crises, when our ambitions lie in ruins at our feet, when we realize in remorse and agony the sad mess we have made of our lives, when we cry out 'Why are we here?' 'What does all this mean and where do we go from here?' 'My God, My God, why hast thou forsaken me?'</p>\n<p>Arjuna passes through a great spiritual tension. When he detaches himself from his social obligations and asks why he should carry out the duty expected of him by society, he gets behind his socialized self and has full awareness of himself as an individual, alone and isolaed. He faces the world as a stranger thrown into a threatening chaos. The new freedom creates a deep feeling of anxiety, aloneness, doubt and insecurity. If he is to function successfully, these feelings must be overcome.</p>"},"allNotesIndex":{"base_name":"notes","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes","notes_data":[{"id":"quotes","metadata":{"title":"Quotes","date":"2023-03-21"}}],"directories":[{"base_name":"book notes","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/book notes","notes_data":[{"id":"dokkodo","metadata":{"title":"Dokkodo","date":"2023-03-23"}},{"id":"if","metadata":{"title":"\"If\"","date":"2023-03-27"}},{"id":"worry","metadata":{"title":"Worry","date":"2023-03-29"}}],"directories":[{"base_name":"the bhagvad gita","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/book notes/the bhagvad gita","notes_data":[{"id":"chapter_1","metadata":{"title":"Chapter 1","date":"2023-04-06"}},{"id":"chapter_2","metadata":{"title":"Chapter 2","date":"2023-04-08"}},{"id":"index","metadata":{"title":"The Bhagvad Gita","date":"2023-04-06"}}],"directories":[]}]},{"base_name":"economics","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/economics","notes_data":[],"directories":[{"base_name":"microeconomics","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/economics/microeconomics","notes_data":[{"id":"index","metadata":{"title":"Principles of Microeconomics","date":"2023-03-23"}},{"id":"lecture_1","metadata":{"title":"Lecture 1","date":"2023-03-23"}},{"id":"lecture_2","metadata":{"title":"Lecture 2","date":"2023-03-23"}},{"id":"lecture_3","metadata":{"title":"Lecture 3","date":"2023-03-23"}},{"id":"lecture_4","metadata":{"title":"Lecture 4","date":"2023-04-01"}},{"id":"lecture_5","metadata":{"title":"Lecture 5","date":"2023-04-01"}},{"id":"lecture_6","metadata":{"title":"Lecture 6","date":"2023-04-01"}}],"directories":[]}]},{"base_name":"machine learning","full_path":"/home/runner/work/krkartikay.github.io/krkartikay.github.io/notes/machine learning","notes_data":[{"id":"cpp-grad","metadata":{"title":"cpp-grad","date":"2023-04-17"}},{"id":"interview-gpt3","metadata":{"title":"Interview with GPT-3.5","date":"2023-04-21"}},{"id":"interview-gpt4","metadata":{"title":"Interview with GPT-4","date":"2023-04-21"}}],"directories":[]}]}},"__N_SSG":true}